---
kind: method
id: M:Autodesk.Revit.DB.Infrastructure.Alignment.GetAlignments(Autodesk.Revit.DB.View)
source: html/f999b171-5b95-f3c6-df18-a9f0c12c69d3.htm
---
# Autodesk.Revit.DB.Infrastructure.Alignment.GetAlignments Method

Returns all alignments visible in the given view.

## Syntax (C#)
```csharp
public static ICollection<Alignment> GetAlignments(
	View view
)
```

## Parameters
- **view** (`Autodesk.Revit.DB.View`) - The view for which the alignments are returned.